login as: admin
Pre-authentication banner message from server:
| Debian GNU/Linux 9
|
| Dell EMC Networking Operating System (OS10)
End of banner message from server
admin@10.10.10.21's password:
Linux OS10 4.9.189 #1 SMP Debian 4.9.189-3+deb9u1 x86_64

The programs included with the Debian GNU/Linux system are free software;
the exact distribution terms for each program are described in the
individual files in /usr/share/doc/*/copyright.

Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
permitted by applicable law.


-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
-*         Dell EMC  Network Operating System (OS10)           *-
-*                                                             *-
-* Copyright (c) 1999-2019 by Dell Inc. All Rights Reserved.   *-
-*                                                             *-
-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-

This product is protected by U.S. and international copyright and
intellectual property laws. Dell EMC and the Dell EMC logo are
trademarks of Dell Inc. in the United States and/or other
jurisdictions. All other marks and names mentioned herein may be
trademarks of their respective companies.

%Warning : Default password for admin account should be changed to secure the system

OS10# show running-configuration
! Version 10.5.0.4
! Last configuration change at Mar  20 00:14:50 2024
!
ip vrf default
!
interface breakout 1/1/25 map 100g-1x
interface breakout 1/1/26 map 100g-1x
iscsi enable
iscsi target port 860
iscsi target port 3260
system-user linuxadmin password $6$5DdOHYg5$JCE1vMSmkQOrbh31U74PIPv7lyOgRmba1IxhkYibppMXs1KM4Y                               .gbTPcxyMP/PHUkMc5rdk/ZLv9Sfv3ALtB61
username admin password $6$q9QBeYjZ$jfxzVqGhkxX3smxJSH9DDz7/3OJc6m5wjF8nnLD7/VKx8SloIhp4NoGZs0                               I/UNwh8WVuxwfd9q4pWIgNs5BKH. role sysadmin priv-lvl 15
username tburns password $6$rounds=656000$GlxkZSsFItqeExQB$wzGgY4vx5/vQn3FWZYp/vJHCuB/bEDq25lR                               LpxAfbPSPHWzBsBiV6fiBBTayTqZrYm7oAgLXbDPTRlndUrxes/ role sysadmin priv-lvl 15
aaa authentication login default local
aaa authentication login console local
!
class-map type application class-iscsi
!
policy-map type application policy-iscsi
!
interface vlan1
 no shutdown
!
interface mgmt1/1/1
 no shutdown
 no ip address dhcp
 ip address 10.10.10.21/24
 ipv6 address autoconfig
!
interface ethernet1/1/1
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/2
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/3
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/4
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/5
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/6
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/7
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/8
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/9
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/10
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/11
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/12
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/13
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/14
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/15
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/16
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/17
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/18
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/19
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/20
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/21
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/22
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/23
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/24
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/25
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/26
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/27
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/28
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/29
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/30
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
management route 0.0.0.0/0 10.10.10.1
!
snmp-server contact "Contact Support"
!
telemetry
OS10#
OS10# show running-configuration
! Version 10.5.0.4
! Last configuration change at Mar  20 00:14:50 2024
!
ip vrf default
!
interface breakout 1/1/25 map 100g-1x
interface breakout 1/1/26 map 100g-1x
iscsi enable
iscsi target port 860
iscsi target port 3260
system-user linuxadmin password $6$5DdOHYg5$JCE1vMSmkQOrbh31U74PIPv7lyOgRmba1IxhkYibppMXs1KM4Y.gbTPcxyMP/PHUkMc5rdk/ZLv9Sfv3ALtB61
username admin password $6$q9QBeYjZ$jfxzVqGhkxX3smxJSH9DDz7/3OJc6m5wjF8nnLD7/VKx8SloIhp4NoGZs0I/UNwh8WVuxwfd9q4pWIgNs5BKH. role sysadmin priv-lvl 15
username tburns password $6$rounds=656000$GlxkZSsFItqeExQB$wzGgY4vx5/vQn3FWZYp/vJHCuB/bEDq25lRLpxAfbPSPHWzBsBiV6fiBBTayTqZrYm7oAgLXbDPTRlndUrxes/ role sysadmin priv-lvl 15
aaa authentication login default local
aaa authentication login console local
!
class-map type application class-iscsi
!
policy-map type application policy-iscsi
!
interface vlan1
 no shutdown
!
interface mgmt1/1/1
 no shutdown
 no ip address dhcp
 ip address 10.10.10.21/24
 ipv6 address autoconfig
!
interface ethernet1/1/1
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/2
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/3
 no shutdown
 switchport access vlan 1
 flowcontrol receive on
!
interface ethernet1/1/4
 no shutdown
OS10# cpmf
% Error: Unrecognized command.
OS10# configure terminal
OS10(config)# interface port-channel128
OS10(conf-if-po-128)# no shutdown
OS10(conf-if-po-128)# switchport access vlan 1
OS10(conf-if-po-128)# !
OS10(conf-if-po-128)# sh
show     shutdown
OS10(conf-if-po-128)#
OS10(conf-if-po-128)# do show lldp neighbors
Loc PortID          Rem Host Name        Rem Port Id                    Rem Chassis Id
--------------------------------------------------------------------------------------
ethernet1/1/1       Broadcom Adv. Dua... 5c:6f:69:f4:d8:80             5c:6f:69:f4:d8:80
ethernet1/1/19      Not Advertised       00:60:48:6a:3b:d5             00:60:48:6a:3b:d5
ethernet1/1/2       Broadcom Adv. Dua... 5c:6f:69:f4:b2:b0             5c:6f:69:f4:b2:b0
ethernet1/1/23      Not Advertised       6c:fe:54:20:01:30             6c:fe:54:20:01:30
ethernet1/1/27      OS10                 ethernet1/1/27                f0:d4:e2:7b:c4:04
ethernet1/1/28      OS10                 ethernet1/1/28                f0:d4:e2:7b:c4:04
ethernet1/1/29      OS10                 ethernet1/1/29                f0:d4:e2:7b:c4:04
ethernet1/1/3       Broadcom Adv. Dua... 5c:6f:69:f4:13:20             5c:6f:69:f4:13:20
ethernet1/1/30      OS10                 ethernet1/1/30                f0:d4:e2:7b:c4:04
mgmt1/1/1           HP 5400 ZL2 CORE     33                            14:58:d0:db:c3:00
OS10(conf-if-po-128)# exit
OS10(config)# hostname F10-SW1
F10-SW1(config)# hostname F10-SW1
F10-SW1(config)# do show lldp neighbors
Loc PortID          Rem Host Name        Rem Port Id                    Rem Chassis Id
--------------------------------------------------------------------------------------
ethernet1/1/1       Broadcom Adv. Dua... 5c:6f:69:f4:d8:80             5c:6f:69:f4:d8:80
ethernet1/1/19      Not Advertised       00:60:48:6a:3b:d5             00:60:48:6a:3b:d5
ethernet1/1/2       Broadcom Adv. Dua... 5c:6f:69:f4:b2:b0             5c:6f:69:f4:b2:b0
ethernet1/1/23      Not Advertised       6c:fe:54:20:01:30             6c:fe:54:20:01:30
ethernet1/1/27      F10-SW2              ethernet1/1/27                f0:d4:e2:7b:c4:04
ethernet1/1/28      F10-SW2              ethernet1/1/28                f0:d4:e2:7b:c4:04
ethernet1/1/29      F10-SW2              ethernet1/1/29                f0:d4:e2:7b:c4:04
ethernet1/1/3       Broadcom Adv. Dua... 5c:6f:69:f4:13:20             5c:6f:69:f4:13:20
ethernet1/1/30      F10-SW2              ethernet1/1/30                f0:d4:e2:7b:c4:04
mgmt1/1/1           HP 5400 ZL2 CORE     33                            14:58:d0:db:c3:00
F10-SW1(config)# interface ethernet1/1/27
F10-SW1(conf-if-eth1/1/27)# no shutdown
F10-SW1(conf-if-eth1/1/27)# channel-group 128 mode active
F10-SW1(conf-if-eth1/1/27)# no switchport
F10-SW1(conf-if-eth1/1/27)# flowcontrol receive on
F10-SW1(conf-if-eth1/1/27)# !
F10-SW1(conf-if-eth1/1/27)# interface ethernet1/1/28
F10-SW1(conf-if-eth1/1/28)# no shutdown
F10-SW1(conf-if-eth1/1/28)# channel-group 128 mode active
F10-SW1(conf-if-eth1/1/28)# no switchport
F10-SW1(conf-if-eth1/1/28)# flowcontrol receive on
F10-SW1(conf-if-eth1/1/28)# !
F10-SW1(conf-if-eth1/1/28)# interface ethernet1/1/29
F10-SW1(conf-if-eth1/1/29)# no shutdown
F10-SW1(conf-if-eth1/1/29)# channel-group 128 mode active
F10-SW1(conf-if-eth1/1/29)# no switchport
F10-SW1(conf-if-eth1/1/29)# flowcontrol receive on
F10-SW1(conf-if-eth1/1/29)# !
F10-SW1(conf-if-eth1/1/29)# interface ethernet1/1/30
F10-SW1(conf-if-eth1/1/30)# no shutdown
F10-SW1(conf-if-eth1/1/30)# channel-group 128 mode active
F10-SW1(conf-if-eth1/1/30)# no switchport
F10-SW1(conf-if-eth1/1/30)# flowcontrol receive on
F10-SW1(conf-if-eth1/1/30)#
F10-SW1(conf-if-eth1/1/30)# end
F10-SW1# show port-channel summary

Flags:  D - Down    I - member up but inactive    P - member up and active
        U - Up (port-channel)    F - Fallback Activated
--------------------------------------------------------------------------------
Group Port-Channel           Type     Protocol  Member Ports
--------------------------------------------------------------------------------
128  port-channel128  (U)     Eth      DYNAMIC   1/1/27(P) 1/1/28(P) 1/1/29(P) 1/1/30(P)
F10-SW1# write memory
F10-SW1#
F10-SW1#
F10-SW1# show version
Dell EMC Networking OS10 Enterprise
Copyright (c) 1999-2020 by Dell Inc. All Rights Reserved.
OS Version: 10.5.0.4
Build Version: 10.5.0.4.638
Build Time: 2020-01-30T21:08:56+0000
System Type: S4128F-ON
Architecture: x86_64
Up Time: 00:11:13
F10-SW1# copy config://startup.xml sftp://tburns:XCVbgh78&*@10.10.20.20/sw2_backup.xml
^[[D^[[DF10-SW1#
F10-SW1# copy config://startup.xml sftp://tburns:XCVbgh78&*@10.10.20.20/sw1_backup.xml
F10-SW1# show license status

System Information
---------------------------------------------------------
Vendor Name          :   Dell EMC
Product Name         :   S4128F-ON
Hardware Version     :   A06
Platform Name        :   x86_64-dellemc_s4128f_c2338-r0
PPID                 :   TW0FFR83DNG001180482
Service Tag          :   9P88V43
Product Base         :
Product Serial Number:
Product Part Number  :
License Details
----------------
Software        :        OS10-Enterprise
Version         :        10.5.0.4
License Type    :        PERPETUAL
License Duration:        Unlimited
License Status  :        Active
License location:        /mnt/license/9P88V43.lic
---------------------------------------------------------
F10-SW1#
F10-SW1#
F10-SW1#
F10-SW1# system "sudo /mnt/onie-boot/onie/tools/bin/onie-version"
[sudo] password for admin:
ONIE version        : 3.33.1.1-6
ONIE vendor_id      : 674
ONIE platform       : x86_64-dellemc_s4100_c2338-r0
ONIE machine        : dellemc_s4100_c2338
ONIE machine_rev    : 0
ONIE arch           : x86_64
ONIE config_version : 1
ONIE build_date     : 2017-10-19T10:30-0700
ONIE partition_type : gpt
ONIE kernel_version : 4.1.28
ONIE firmware       : auto
ONIE switch_asic    : bcm
ONIE skip_ethmgmt_macs: no
F10-SW1# show system

Node Id              : 1
MAC                  : f0:d4:e2:59:ca:bb
Number of MACs       : 128
Up Time              : 00:31:57

-- Unit 1 --
Status                     : up
System Identifier          : 1
Down Reason                : user-triggered
Digital Optical Monitoring : disable
System Location LED        : off
Required Type              : S4128
Current Type               : S4128
Hardware Revision          : A06
Software Version           : 10.5.0.4
Physical Ports             : 28x10GbE, 2x100GbE
BIOS                          : 3.33.0.1-7
System CPLD                   : 1.1
Master CPLD                   : 1.0
Slave CPLD                    : 0.7

-- Power Supplies --
PSU-ID  Status      Type    AirFlow   Fan  Speed(rpm)  Status
----------------------------------------------------------------
1       up          AC      REVERSE   1    11632       up

2       up          AC      REVERSE   1    11696       up


-- Fan Status --
FanTray  Status      AirFlow   Fan  Speed(rpm)  Status
----------------------------------------------------------------
1        up          REVERSE   1    11014       up

2        up          REVERSE   1    10983       up

3        up          REVERSE   1    11076       up

4        up          REVERSE   1    11014       up


F10-SW1# system bash
admin@F10-SW1:~$ dmesg | grep 3IE3
[    1.426948] ata5.00: ATA-8: InnoDisk Corp. - mSATA 3IE3, S16425c1, max UDMA/133
admin@F10-SW1:~$
